АлогистикТест2/src/Reports/алк_ПриемкаЛесопродукцииГОСТ_ДопДанныеПоставщика/алк_ПриемкаЛесопродукцииГОСТ_ДопДанныеПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>алк_ПриемкаЛесопродукцииГОСТ_ДопДанныеПоставщика</name>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

АлогистикТест2/src/AccumulationRegisters/алк_УчетЛесопродукцииГОСТ/алк_УчетЛесопродукцииГОСТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_УчетЛесопродукцииГОСТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_УчетЛесопродукцииТД/алк_УчетЛесопродукцииТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_УчетЛесопродукцииТД</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.рфп_ОтгрузкаВагона</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Reports/алк_ПриемкаЛесопродукцииГОСТ_ДопДанныеПоставщика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		
		// +РФП Чемезов
		ВывестиШапкуОтчета(ДокументРезультат);
		// -РФП Чемезов
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(
			СхемаКомпоновкиДанных,
			КомпоновщикНастроек.ПолучитьНастройки(),
			ДанныеРасшифровки);
		
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(
			МакетКомпоновки,
			,
			ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		//КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	КонецПроцедуры
	
	Процедура ВывестиШапкуОтчета(ДокументРезультат)
		
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		ТекущийВариантОтчета = НастройкиОтчета.ДополнительныеСвойства.ВариантНаименование;
		
		Если ТекущийВариантОтчета <> "Акт приемки баржи" Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НачалоПериода", Дата("00010101"));
		СтруктураПараметров.Вставить("КонецПериода", Дата("00010101"));
		
		ИдентификаторыОтборов = Новый Структура;
		ИдентификаторыОтборов.Вставить("Производитель", "");
		ИдентификаторыОтборов.Вставить("Порода", "");
		ИдентификаторыОтборов.Вставить("НомерНакладной", "");
		
		Для Каждого ТекущийОтбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если ТекущийОтбор.ПредставлениеПользовательскойНастройки = "Производитель" Тогда 
				ИдентификаторыОтборов.Производитель = ТекущийОтбор.ИдентификаторПользовательскойНастройки;
			ИначеЕсли ТекущийОтбор.ПредставлениеПользовательскойНастройки = "Порода" Тогда
				ИдентификаторыОтборов.Порода = ТекущийОтбор.ИдентификаторПользовательскойНастройки;
			ИначеЕсли ТекущийОтбор.ПредставлениеПользовательскойНастройки = "Номер накладной" Тогда
				ИдентификаторыОтборов.НомерНакладной = ТекущийОтбор.ИдентификаторПользовательскойНастройки;
			КонецЕсли;

		КонецЦикла;
		
		Для Каждого ТекущаяНастройка Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			
			Если ТипЗнч(ТекущаяНастройка) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда				
				
				Если ТекущаяНастройка.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.Производитель 
					И ТекущаяНастройка.Использование Тогда
					СтруктураПараметров.Вставить("Производитель", ТекущаяНастройка.ПравоеЗначение);
				КонецЕсли;
				
				Если ТекущаяНастройка.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.Порода 
					И ТекущаяНастройка.Использование Тогда
					СтруктураПараметров.Вставить("Порода", ТекущаяНастройка.ПравоеЗначение);
				КонецЕсли;
				
				Если ТекущаяНастройка.ИдентификаторПользовательскойНастройки = ИдентификаторыОтборов.НомерНакладной 
					И ТекущаяНастройка.Использование Тогда
					СтруктураПараметров.Вставить("НомерНакладной", ТекущаяНастройка.ПравоеЗначение);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ТекущаяНастройка) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				Если ТекущаяНастройка.Параметр = Новый ПараметрКомпоновкиДанных("ПериодСТ") Тогда
					СтруктураПараметров.НачалоПериода = ТекущаяНастройка.Значение.ДатаНачала;
					СтруктураПараметров.КонецПериода = ТекущаяНастройка.Значение.ДатаОкончания;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
		
		ДанныеШапкиОтчета = ДанныеШапкиОтчета(СтруктураПараметров);
		МакетОтчета = ПолучитьМакет("ШапкаОтчета");
		
		ОбластьШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
		ЗаполнитьЗначенияСвойств(ОбластьШапкаОтчета.Параметры, ДанныеШапкиОтчета); 
		ПредставлениеОрганизации = "" + ДанныеШапкиОтчета.Организация + " " + ДанныеШапкиОтчета.АдресОрганизации;
		ОбластьШапкаОтчета.Параметры.Получатель   = ПредставлениеОрганизации;
		ОбластьШапкаОтчета.Параметры.ДатаОтчета   = Формат(ДанныеШапкиОтчета.ДатаОтчета, "ДФ=dd.MM.yyyy");
		ОбластьШапкаОтчета.Параметры.ДатаОтгрузки = Формат(ДанныеШапкиОтчета.ДатаОтгрузки, "ДФ=dd.MM.yyyy");
		ОбластьШапкаОтчета.Параметры.ДатаПриемки  = Формат(ДанныеШапкиОтчета.ДатаПриемки, "ДФ=dd.MM.yyyy");
		
		ДокументРезультат.Вывести(ОбластьШапкаОтчета);			

КонецПроцедуры
	
	#КонецОбласти
	
	Функция ДанныеШапкиОтчета(СтруктураПараметров) 
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 
		#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Документ.алк_ПриемкаЛесопродукции) КАК Регистратор,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель,
		|	алк_УчетЛесопродукцииГОСТОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода,
		|	ВЫРАЗИТЬ(алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Документ.алк_ПриемкаЛесопродукции).Производитель КАК Производитель,
		|	ВЫРАЗИТЬ(алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Документ.алк_ПриемкаЛесопродукции).НомерНакладной КАК НомерНакладной,
		|	ВЫРАЗИТЬ(алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Документ.алк_ПриемкаЛесопродукции).Организация КАК Организация
		|ПОМЕСТИТЬ втРезультат
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииГОСТ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК алк_УчетЛесопродукцииГОСТОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_УчетЛесопродукцииГОСТОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|  //ОтборыГОСТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_УчетЛесопродукцииТДОбороты.Регистратор,
		|	""ТД"",
		|	алк_УчетЛесопродукцииТДОбороты.Номенклатура,
		|	алк_УчетЛесопродукцииТДОбороты.Порода,
		|	алк_УчетЛесопродукцииТДОбороты.Регистратор.Производитель,
		|	алк_УчетЛесопродукцииТДОбороты.Регистратор.НомерНакладной,
		|	алк_УчетЛесопродукцииТДОбороты.Регистратор.Организация
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииТД.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК алк_УчетЛесопродукцииТДОбороты
		|  //ОтборыТД
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(втРезультат.Регистратор.ДатаОтгрузки) КАК ДатаОтгрузки,
		|	МАКСИМУМ(втРезультат.Регистратор.Организация) КАК Организация,
		|	втРезультат.Регистратор.НомерНакладной КАК НомерБаржи,
		|	МАКСИМУМ(втРезультат.Регистратор.Производитель) КАК Грузоотправитель,
		|	МАКСИМУМ(втРезультат.Регистратор.Дата) КАК ДатаПриемки,
		|	МАКСИМУМ(втРезультат.Регистратор.Дата) КАК ДатаОтчета,
		|	ЕСТЬNULL(ОрганизацииКонтактнаяИнформация.Представление, """") КАК АдресОрганизации
		|ИЗ
		|	втРезультат КАК втРезультат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО втРезультат.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Тип = &ТипАдреса
		|				И ОрганизацииКонтактнаяИнформация.Вид = &ВидАдреса)
		|
		|СГРУППИРОВАТЬ ПО
		|	втРезультат.Регистратор.НомерНакладной,
		|	ЕСТЬNULL(ОрганизацииКонтактнаяИнформация.Представление, """")";
		#КонецОбласти
		
		Запрос.УстановитьПараметр("ТипАдреса", Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("ВидАдреса", Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		
		ТекстОтборыГОСТ = "ГДЕ ";
		ТекстОтборыТД = "ГДЕ ";
		
		Для Каждого ТекущийПараметр Из СтруктураПараметров Цикл
			
			Запрос.УстановитьПараметр(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);	
			
			Если ТекущийПараметр.Ключ = "Производитель" Тогда
				ТекстОтборыГОСТ = ТекстОтборыГОСТ 	+ "алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Производитель = &Производитель " + "И "; 
				ТекстОтборыТД 	= ТекстОтборыТД		+ "алк_УчетЛесопродукцииТДОбороты.Регистратор.Производитель = &Производитель "  + "И ";
			КонецЕсли;
			
			Если ТекущийПараметр.Ключ = "Порода" Тогда 
				ТекстОтборыГОСТ = ТекстОтборыГОСТ 	+ "алк_ПараметрыХарактеристик.Порода = &Порода " + "И "; 
				ТекстОтборыТД 	= ТекстОтборыТД		+ "алк_УчетЛесопродукцииТДОбороты.Порода = &Порода "  + "И ";
			КонецЕсли;
			
			Если ТекущийПараметр.Ключ = "НомерНакладной" Тогда 
				ТекстОтборыГОСТ = ТекстОтборыГОСТ 	+ "алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерНакладной = &НомерНакладной " + "И "; 
				ТекстОтборыТД 	= ТекстОтборыТД		+ "алк_УчетЛесопродукцииТДОбороты.Регистратор.НомерНакладной = &НомерНакладной "  + "И ";
			КонецЕсли;
				
		КонецЦикла;
		
		Если ТекстОтборыГОСТ <> "ГДЕ " Тогда
			ТекстОтборыГОСТ = Лев(ТекстОтборыГОСТ, СтрДлина(ТекстОтборыГОСТ) - 2);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ОтборыГОСТ", ТекстОтборыГОСТ);
		КонецЕсли;
		Если ТекстОтборыТД <> "ГДЕ " Тогда
			ТекстОтборыТД 	= Лев(ТекстОтборыТД, СтрДлина(ТекстОтборыТД) - 2);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ОтборыТД", ТекстОтборыТД);
		КонецЕсли;
		
		Общегоназначенияклиентсервер.СообщитьПользователю(ТекстЗапроса);
		
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи;
		Иначе
			ПустаяШапка = Новый Структура;
			ПустаяШапка.Вставить("Организация", "");
			ПустаяШапка.Вставить("АдресОрганизации", "");
			ПустаяШапка.Вставить("ДатаПриемки", Дата("00010101"));
			ПустаяШапка.Вставить("ДатаОтгрузки", Дата("00010101"));
			ПустаяШапка.Вставить("ДатаОтчета", Дата("00010101"));
			ПустаяШапка.Вставить("Грузоотправитель", "");
			ПустаяШапка.Вставить("Получатель", "");
			ПустаяШапка.Вставить("НомерБаржи", "");
			
			Возврат ПустаяШапка;	
		КонецЕсли;		
		
	КонецФункции
	
	ЭтоОтчетУНФ = Ложь;
	
#КонецЕсли
